In this post we will see Different ways of creating a pandas DataFrame and editing it

Lets first import the Python Pandas and numpy module

In [2]:
import pandas as pd
import numpy as np
import random
pd.set_option('display.width', 1000)

## Create a DataFrame from a List

In [3]:
seasons = ['Winter','Spring','Summer','Fall']
df = pd.DataFrame(seasons)
print(df)

        0
0  Winter
1  Spring
2  Summer
3    Fall

## Merge DataFrame

In [12]:
data1 = {"Country":["USA","Mexico","Brazil"],"Jan_Sales":[1000,2000,3000]}
data2 = {"Country":["Canada","Mexico","Brazil","Belgium"],"Feb_Sales":[4000,5000,6000,7000]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
#Pandas merge function can automatically detect which columns are common between the dataframes 
#Pandas will use the common columns to merge the two dataframes
display(df1)
display(df2)

  Country  Jan_Sales
0     USA       1000
1  Mexico       2000
2  Brazil       3000

   Country  Feb_Sales
0   Canada       4000
1   Mexico       5000
2   Brazil       6000
3  Belgium       7000

In [13]:
df3 = df1.merge(df2)
display(df3)

  Country  Jan_Sales  Feb_Sales
0  Mexico       2000       5000
1  Brazil       3000       6000

### Inner Merge

In [14]:
df4 = df1.merge(df2,how='inner')
display(df4)

  Country  Jan_Sales  Feb_Sales
0  Mexico       2000       5000
1  Brazil       3000       6000

### Outer Merge

In [15]:
df5 = df1.merge(df2,how='outer')
display(df5)

   Country  Jan_Sales  Feb_Sales
0      USA     1000.0        NaN
1   Mexico     2000.0     5000.0
2   Brazil     3000.0     6000.0
3   Canada        NaN     4000.0
4  Belgium        NaN     7000.0

### Left merge

In [16]:
df6 = df1.merge(df2,how='left')
display(df6)

  Country  Jan_Sales  Feb_Sales
0     USA       1000        NaN
1  Mexico       2000     5000.0
2  Brazil       3000     6000.0

### Right merge

In [17]:
df7 = df1.merge(df2,how='right')
display(df7)

   Country  Jan_Sales  Feb_Sales
0   Canada        NaN       4000
1   Mexico     2000.0       5000
2   Brazil     3000.0       6000
3  Belgium        NaN       7000